In [1]:
#Empty dataframe
import pandas as pd
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [6]:
#Series to Data Frame
emp=pd.Series(['Paker','John','Smith','William'])
id=pd.Series([102,107,109,114])
frame={'Emp':emp,'ID':id}
result=pd.DataFrame(frame)
print("\nSeries to Data Frame\n")
print(result)

Series to Data Frame

       Emp   ID
0    Paker  102
1     John  107
2    Smith  109
3  William  114

In [13]:
#Extraction one column
print("\nExtraction one column:\n")
print(result['Emp'])

Extraction one column:

0       Paker
1        John
2       Smith
3     William
4    Dale,123
5        Mark
6    Dale,123
7        Mark
Name: Emp, dtype: object

In [3]:
#Adding a one extra column
print("\nAdding new column:\n")
result['Age']=pd.Series([35,24,40,38])
print(result)

Adding new column:

       Emp   ID  Age
0    Paker  102   35
1     John  107   24
2    Smith  109   40
3  William  114   38

In [5]:
#Deleting one column
print("\nDeleting one column:\n")
del result['Age']
print(result)

Deleting one column:

       Emp   ID
0    Paker  102
1     John  107
2    Smith  109
3  William  114

In [7]:
#Extracting the third rows
print("\nExtracting the third rows:\n")
print(result.loc[2])

Extracting the third rows:

Emp    Smith
ID       109
Name: 2, dtype: object

In [8]:
#slice rows
print("\nSlice rows:\n",result[1:3])

Slice rows:
      Emp   ID
1   John  107
2  Smith  109

In [15]:
#Adding new row values
d2=pd.DataFrame([['Dale,123'],['Mark',143]],columns=['Emp','ID'])
result=pd.concat([result,d2],ignore_index=True)
print("\nAdding new row values:\n",result)

Adding new row values:
         Emp     ID
0     Paker  102.0
1      John  107.0
2     Smith  109.0
3   William  114.0
4  Dale,123    NaN
5      Mark  143.0
6  Dale,123    NaN
7      Mark  143.0
8  Dale,123    NaN
9      Mark  143.0

In [14]:
#Deleting the particular row
print("\nDeleting particular row:\n",result.drop(1))

Deleting particular row:
         Emp     ID
0     Paker  102.0
2     Smith  109.0
3   William  114.0
4  Dale,123    NaN
5      Mark  143.0
6  Dale,123    NaN
7      Mark  143.0